Revit 2018 API
StructuralSectionISplitSlopedFlange Constructor
Overload List
Name | Description
StructuralSectionISplitSlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double) |  Obsolete.
 Creates a new instance of Structural Section I Split Sloped Flange shape with the associated set of parameters, used to attach to structural element.
StructuralSectionISplitSlopedFlange(Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section I Split Sloped Flange shape with the associated set of parameters, used to attach to structural element.
See Also
StructuralSectionISplitSlopedFlange Class
StructuralSectionISplitSlopedFlange Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace